Hi @spiedra,

```
➜  terraform-provider-bigip git:(master) terraform version
Terraform v1.5.0
on darwin_arm64
+ provider registry.terraform.io/f5networks/bigip v1.20.1
````

I have not able to reproduce this issue please try on v1.20.1(BIG-IP)

```
 # bigip_waf_policy.test_basic_pol_iso will be created
  + resource "bigip_waf_policy" "test_basic_pol_iso" {
      + application_language = "utf-8"
      + case_insensitive     = false
      + description          = (known after apply)
      + enable_passivemode   = false
      + id                   = (known after apply)
      + name                 = "Test-asm-policy"
      + partition            = "Common"
      + policy_export_json   = (known after apply)
      + policy_id            = (known after apply)
      + policy_import_json   = jsonencode(
            {
              + policy = {
                  + applicationLanguage = "utf-8"
                  + caseInsensitive     = false
                  + description         = "Fundamental Policy"
                  + enablePassiveMode   = false
                  + enforcementMode     = "blocking"
                  + fullPath            = "/Common/scenario5"
                  + general             = {
                      + enforcementReadinessPeriod = 0
                    }
                  + name                = "scenario5"
                  + policy-builder      = {
                      + enableUntrustedTrafficSiteChangeTracking = true
                      + learningMode                             = "manual"
                      + trafficTighten                           = {
                          + maxModificationSuggestionScore = 60
                          + totalRequests                  = 10000
                        }
                      + untrustedTrafficLoosen                   = {
                          + differentSources       = 10
                          + minHoursBetweenSamples = 0.5
                        }
                      + untrustedTrafficSiteChangeTracking       = {
                          + differentSources         = 5
                          + minMinutesBetweenSamples = 15
                        }
                    }
                  + protocolIndependent = false
                  + softwareVersion     = "16.1.2"
                  + template            = {
                      + name = "POLICY_TEMPLATE_FUNDAMENTAL"
                    }
                  + type                = "security"
                }
            }
        )
      + template_name        = "POLICY_TEMPLATE_FUNDAMENTAL"
      + type                 = "security"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_waf_policy.test_basic_pol_iso: Creating...
bigip_waf_policy.test_basic_pol_iso: Still creating... [10s elapsed]



bigip_waf_policy.test_basic_pol_iso: Still creating... [20s elapsed]
bigip_waf_policy.test_basic_pol_iso: Still creating... [30s elapsed]
bigip_waf_policy.test_basic_pol_iso: Creation complete after 39s [id=J-nKFoHicbfxlE8LDeoL2w]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```